{"<PAD>": 0, "<UNK>": 1, "end": 2, "col": 3, "pos": 4, "if": 5, "row": 6, "column": 7, "buf": 8, "len": 9, "a": 10, "i": 11, "T": 12, "code": 13, "the": 14, "to": 15, "x": 16, "String": 17, "for": 18, "Parsers": 19, "options": 20, "Union": 21, "return": 22, "types": 23, "columns": 24, "Vector": 25, "inbounds": 26, "of": 27, "UInt8": 28, "f": 29, "file": 30, "nothing": 31, "header": 32, "in": 33, "type": 34, "function": 35, "io": 36, "false": 37, "Bool": 38, "CSV": 39, "File": 40, "or": 41, "r": 42, "be": 43, "isa": 44, "names": 45, "Type": 46, "elseif": 47, "Base": 48, "Int": 49, "else": 50, "rows": 51, "parsing": 52, "tlen": 53, "Missing": 54, "and": 55, "is": 56, "ncols": 57, "Nothing": 58, "flags": 59, "pool": 60, "true": 61, "b": 62, "source": 63, "Int64": 64, "debug": 65, "tape": 66, "e": 67, "refs": 68, "length": 69, "as": 70, "Float64": 71, "Char": 72, "rowsguess": 73, "where": 74, "we": 75, "delim": 76, "Symbol": 77, "datarow": 78, "Dict": 79, "limit": 80, "println": 81, "vlen": 82, "opts": 83, "string": 84, "transpose": 85, "vpos": 86, "ctx": 87, "will": 88, "values": 89, "Tables": 90, "an": 91, "j": 92, "that": 93, "missing": 94, "rowoffset": 95, "datapos": 96, "UInt32": 97, "t": 98, "typemap": 99, "while": 100, "typecodes": 101, "dateformat": 102, "can": 103, "cols": 104, "data": 105, "positions": 106, "are": 107, "Integer": 108, "error": 109, "read": 110, "N": 111, "xparse": 112, "h": 113, "jl": 114, "on": 115, "use": 116, "cq": 117, "nm": 118, "getfield": 119, "threaded": 120, "flag": 121, "Dates": 122, "df": 123, "name": 124, "ref": 125, "csv": 126, "with": 127, "n": 128, "categorical": 129, "argument": 130, "s": 131, "by": 132, "quotechar": 133, "field": 134, "UInt64": 135, "Row": 136, "anymissing": 137, "Threads": 138, "append": 139, "break": 140, "decimal": 141, "const": 142, "val": 143, "IO": 144, "should": 145, "DateTime": 146, "newline": 147, "throw": 148, "Date": 149, "Tuple": 150, "AbstractVector": 151, "sentinel": 152, "c": 153, "kwargs": 154, "inline": 155, "oq": 156, "default": 157, "whether": 158, "skipto": 159, "S": 160, "newT": 161, "escapechar": 162, "ignorerepeated": 163, "detect": 164, "parsed": 165, "this": 166, "customtypes": 167, "strict": 168, "used": 169, "chain": 170, "_": 171, "from": 172, "provided": 173, "openquotechar": 174, "quoted": 175, "missingstring": 176, "bools": 177, "number": 178, "allocate": 179, "all": 180, "d": 181, "A": 182, "each": 183, "any": 184, "MISSING": 185, "value": 186, "it": 187, "typeof": 188, "parsinglayers": 189, "ok": 190, "tapeidx": 191, "pertaskcolumns": 192, "write": 193, "closequotechar": 194, "parse": 195, "undef": 196, "v": 197, "missingstrings": 198, "getcolumn": 199, "parsevalue": 200, "sink": 201, "Column": 202, "silencewarnings": 203, "k": 204, "bytes": 205, "comment": 206, "start": 207, "lookup": 208, "time": 209, "not": 210, "ignoreemptylines": 211, "done": 212, "poslens": 213, "SVec": 214, "ArgumentError": 215, "check": 216, "DataFrame": 217, "detected": 218, "footerskip": 219, "str": 220, "keyword": 221, "index": 222, "try": 223, "eq": 224, "normalizenames": 225, "dec": 226, "threadid": 227, "colrefs": 228, "cmt": 229, "drop": 230, "so": 231, "input": 232, "task": 233, "which": 234, "set": 235, "only": 236, "struct": 237, "tapes": 238, "after": 239, "DateFormat": 240, "task_columns": 241, "how": 242, "position": 243, "at": 244, "include": 245, "ntasks": 246, "select": 247, "Options": 248, "Arg": 249, "chunk": 250, "noinline": 251, "PosLen": 252, "isempty": 253, "y": 254, "Time": 255, "ranges": 256, "get": 257, "goto": 258, "user": 259, "coloptions": 260, "need": 261, "characters": 262, "headerpos": 263, "poslen": 264, "when": 265, "use_mmap": 266, "truestrings": 267, "falsestrings": 268, "columnnames": 269, "needtoquote": 270, "pooled": 271, "refpool": 272, "files": 273, "date": 274, "convert": 275, "thread": 276, "warning": 277, "setposlen": 278, "arguments": 279, "table": 280, "other": 281, "startpos": 282, "indicate": 283, "show": 284, "tasks": 285, "push": 286, "delimiter": 287, "uint64": 288, "delimiters": 289, "stringtype": 290, "PointerString": 291, "AbstractString": 292, "into": 293, "st": 294, "skip": 295, "result": 296, "Error": 297, "AbstractDict": 298, "like": 299, "iterate": 300, "finalrows": 301, "new": 302, "Ptr": 303, "but": 304, "getkwargs": 305, "lazystrings": 306, "using": 307, "pointer": 308, "one": 309, "getnames": 310, "quote": 311, "fatalerror": 312, "something": 313, "PosLenString": 314, "w": 315, "haskey": 316, "starts": 317, "makechain": 318, "character": 319, "first": 320, "args": 321, "typecode": 322, "eltype": 323, "needtoescape": 324, "do": 325, "block": 326, "resize": 327, "re": 328, "sz": 329, "warn": 330, "STRING": 331, "ptr": 332, "byte": 333, "means": 334, "must": 335, "ifelse": 336, "SentinelVector": 337, "our": 338, "res": 339, "Rows": 340, "column1": 341, "task_rows": 342, "may": 343, "multithreaded": 344, "because": 345, "pass": 346, "lastrefs": 347, "getname": 348, "Row2": 349, "invalidly": 350, "Ref": 351, "Int16": 352, "object": 353, "invalidquotedfield": 354, "no": 355, "delimited": 356, "finalcolumns": 357, "getref": 358, "TypeCode": 359, "NT": 360, "PooledString": 361, "threads": 362, "julia": 363, "Trie": 364, "getproperty": 365, "now": 366, "size": 367, "invalid": 368, "allowmissing": 369, "promoting": 370, "key": 371, "eof": 372, "deprecated": 373, "Val": 374, "entire": 375, "intsentinels": 376, "auto": 377, "supports": 378, "initial": 379, "passed": 380, "parsingdebug": 381, "begin": 382, "MissingVector": 383, "empty": 384, "valid": 385, "fields": 386, "given": 387, "DT": 388, "indicating": 389, "Any": 390, "via": 391, "MISSINGTYPE": 392, "F": 393, "nlines": 394, "non": 395, "schema": 396, "catch": 397, "typemax": 398, "useful": 399, "int": 400, "The": 401, "strings": 402, "usually": 403, "refvalue": 404, "borked": 405, "hard": 406, "also": 407, "rowchunkguess": 408, "contain": 409, "codes": 410, "ANYMISSING": 411, "manually": 412, "promote": 413, "interface": 414, "ChainedVector": 415, "single": 416, "access": 417, "over": 418, "ignored": 419, "have": 420, "Data": 421, "maxwarnings": 422, "INT": 423, "writecell": 424, "writeheader": 425, "CatStr": 426, "state": 427, "copy": 428, "DatePart": 429, "starting": 430, "sch": 431, "nonmissingtype": 432, "falses": 433, "transform": 434, "VERSION": 435, "vectype": 436, "trues": 437, "next": 438, "task_col": 439, "EMPTY": 440, "instead": 441, "buffer": 442, "I": 443, "todrop": 444, "map": 445, "seek": 446, "then": 447, "escape": 448, "columnpositions": 449, "actual": 450, "dateformats": 451, "out": 452, "float": 453, "POOLSAMPLESIZE": 454, "was": 455, "newrowsguess": 456, "Mmap": 457, "del": 458, "around": 459, "LazyStringVector": 460, "finaltypes": 461, "same": 462, "line": 463, "fullpath": 464, "FLOAT": 465, "layers": 466, "every": 467, "just": 468, "found": 469, "Strings": 470, "g": 471, "For": 472, "vals": 473, "vector": 474, "were": 475, "ex": 476, "indicates": 477, "PooledArray": 478, "parent": 479, "T1": 480, "cell": 481, "sizeof": 482, "SQLite": 483, "recode": 484, "https": 485, "github": 486, "com": 487, "lock": 488, "generated": 489, "here": 490, "DATETIME": 491, "pools": 492, "Julia": 493, "ensure_full_buf_consumed": 494, "nthreads": 495, "datetime": 496, "bool": 497, "numwarnings": 498, "RefPool": 499, "another": 500, "DATE": 501, "readsplitline": 502, "format": 503, "filename": 504, "cb": 505, "DEV": 506, "NeedsTypeDetection": 507, "uses": 508, "consecutive": 509, "skiptorow": 510, "refrecodes": 511, "either": 512, "db": 513, "ignoreemptyrows": 514, "replaced": 515, "CategoricalPool": 516, "match": 517, "load": 518, "depwarn": 519, "estimated": 520, "propertynames": 521, "transposed": 522, "different": 523, "don": 524, "MISSING_BIT": 525, "T2": 526, "lastref": 527, "IOBuffer": 528, "Sys": 529, "iswindows": 530, "needed": 531, "dt": 532, "Note": 533, "didn": 534, "SmallIntegers": 535, "getlookup": 536, "getindex": 537, "specific": 538, "returned": 539, "duplicate": 540, "mmap": 541, "transforms": 542, "ret": 543, "treated": 544, "PROMOTE_TO_STRING": 545, "cells": 546, "getrows": 547, "readbyte": 548, "tfile": 549, "formatted": 550, "stricterror": 551, "unique": 552, "USER": 553, "V": 554, "final": 555, "warnings": 556, "POOL": 557, "validate": 558, "text": 559, "checkbounds": 560, "range": 561, "provide": 562, "iterating": 563, "Expr": 564, "TR": 565, "Core": 566, "chunks": 567, "case": 568, "per": 569, "willdrop": 570, "ceil": 571, "SentinelArray": 572, "lines_to_check": 573, "before": 574, "P": 575, "escapedstring": 576, "isassigned": 577, "InlineString": 578, "isascii": 579, "getrow": 580, "_promote": 581, "Source": 582, "ensure": 583, "Function": 584, "If": 585, "nms": 586, "directly": 587, "detection": 588, "col1": 589, "boundscheck": 590, "levels": 591, "bom": 592, "StringTypes": 593, "Int8": 594, "module": 595, "id": 596, "bitcast": 597, "guess": 598, "SVec2": 599, "BOOL": 600, "getcolumns": 601, "z": 602, "ReversedBuf": 603, "Real": 604, "getbools": 605, "JuliaData": 606, "quotestrings": 607, "copycols": 608, "lastbytenewline": 609, "could": 610, "downcast": 611, "want": 612, "newnm": 613, "q": 614, "up": 615, "pushfirst": 616, "skipped": 617, "wh1": 618, "wh2": 619, "example": 620, "propagate_inbounds": 621, "immediately": 622, "array": 623, "task_refs": 624, "codeunits": 625, "HTTP": 626, "PosLenStringVector": 627, "PooledArrays": 628, "CategoricalArray": 629, "isdefined": 630, "deleteat": 631, "encountered": 632, "detecting": 633, "fill": 634, "originalpositions": 635, "label": 636, "too": 637, "you": 638, "NamedTuple": 639, "make": 640, "promote_types": 641, "supported": 642, "missingtype": 643, "avoid": 644, "buffer_in_memory": 645, "sources": 646, "full": 647, "attempted_delim": 648, "lastparsedcol": 649, "individual": 650, "Context": 651, "doesn": 652, "Column2": 653, "R": 654, "isvaliddelim": 655, "initialtypes": 656, "RowWriter": 657, "print": 658, "last": 659, "sentinelvalue": 660, "O": 661, "package": 662, "ccall": 663, "bit": 664, "note": 665, "nospecialize": 666, "has": 667, "allowed": 668, "cnt": 669, "concrete": 670, "CategoricalString": 671, "reallocate": 672, "them": 673, "determine": 674, "m": 675, "getsource": 676, "skiptofield": 677, "some": 678, "normalizename": 679, "Schema": 680, "mapping": 681, "gettypes": 682, "two": 683, "Supported": 684, "kw": 685, "open": 686, "Cmd": 687, "parserow": 688, "Int32": 689, "ht_keyindex2": 690, "unescape": 691, "checkcommentandemptyline": 692, "span": 693, "perthreadtapes": 694, "colnames": 695, "computed": 696, "prevT": 697, "static": 698, "notenoughcolumns": 699, "toomanycolumns": 700, "promote_type2": 701, "consumeBOM": 702, "returns": 703, "bufsize": 704, "call": 705, "continue": 706, "Sink": 707, "enumerate": 708, "large": 709, "task_pos": 710, "found_key": 711, "uname": 712, "origrowsguess": 713, "PooledVector": 714, "adjusted": 715, "promote_type1": 716, "step": 717, "TIME": 718, "nbytes": 719, "countfields": 720, "key2": 721, "offlen": 722, "UTF": 723, "Parsing": 724, "tup": 725, "promotetostring": 726, "missings": 727, "timetype": 728, "getcols": 729, "enough": 730, "streaming": 731, "allows": 732, "HardMissing": 733, "favor": 734, "specifies": 735, "doing": 736, "materialize": 737, "represented": 738, "Cssize_t": 739, "allocating": 740, "exact": 741, "tempfile": 742, "UInt": 743, "collect": 744, "origflags": 745, "expected": 746, "together": 747, "multithreadparse": 748, "min": 749, "than": 750, "based": 751, "repeated": 752, "cur": 753, "multiple": 754, "between": 755, "sure": 756, "Csize_t": 757, "makeunique": 758, "RA": 759, "stream": 760, "sqlite_table": 761, "fieldtype": 762, "reading": 763, "passing": 764, "Read": 765, "please": 766, "Cvoid": 767, "lines": 768, "about": 769, "arg": 770, "considered": 771, "task_types": 772, "mutable": 773, "mmapped": 774, "limited": 775, "specify": 776, "D": 777, "zeros": 778, "tt": 779, "local": 780, "layout": 781, "Header": 782, "tltapes": 783, "sync": 784, "rows_to_check": 785, "etc": 786, "within": 787, "fastseek": 788, "lastparsed": 789, "force": 790, "BOM": 791, "url": 792, "parsefilechunk": 793, "most": 794, "support": 795, "checkvaliddelim": 796, "finalize": 797, "EMPTY_TYPEMAP": 798, "finalrefs": 799, "specified": 800, "maybepooled": 801, "textual": 802, "comma": 803, "minrows": 804, "faster": 805, "synchronize": 806, "sentref": 807, "Opens": 808, "Column1": 809, "instance": 810, "cmtlen": 811, "chunksize": 812, "parseint": 813, "parsepooled": 814, "parsestring": 815, "stringdetect": 816, "tl_tapes": 817, "writing": 818, "spawn": 819, "what": 820, "old": 821, "fixed": 822, "findrowstarts": 823, "csvrow": 824, "otherwise": 825, "Range": 826, "copyto": 827, "IndexStyle": 828, "IndexLinear": 829, "rest": 830, "floats": 831, "FilePaths": 832, "generate": 833, "def": 834, "width": 835, "padding": 836, "ByteValueCounter": 837, "similar": 838, "TYPEDETECTED": 839, "parsefield": 840, "normalized": 841, "identifier": 842, "symbols": 843, "decimals": 844, "separated": 845, "would": 846, "change": 847, "StringEncodings": 848, "left": 849, "estimated_rows_left": 850, "finaldone": 851, "form": 852, "newlen": 853, "ESCAPE_BIT": 854, "numrefs": 855, "isn": 856, "selector": 857, "showerror": 858, "Vectors": 859, "tp": 860, "Array": 861, "chunkpositions": 862, "incr": 863, "columnmap": 864, "getio": 865, "resulting": 866, "let": 867, "WeakRefString": 868, "parsingtype": 869, "EMPTY_INT_ARRAY": 870, "CategoricalArrays": 871, "body": 872, "task_len": 873, "failed": 874, "tupcat": 875, "figure": 876, "reallocatetape": 877, "supporting": 878, "columnaccess": 879, "assumed": 880, "setindex": 881, "readline": 882, "iteration": 883, "uniqueness": 884, "become": 885, "a_1": 886, "DB": 887, "many": 888, "your": 889, "tapelen": 890, "By": 891, "database": 892, "DataFrames": 893, "concatenated": 894, "tbl": 895, "delete": 896, "named": 897, "reusebuffer": 898, "unset": 899, "substitute": 900, "WeakRefStrings": 901, "dest": 902, "getbuf": 903, "task_flags": 904, "intsent": 905, "nl": 906, "Like": 907, "silenced": 908, "writenames": 909, "writerow": 910, "promoted": 911, "proportion": 912, "escape_string": 913, "int64": 914, "nonstandardtype": 915, "vec": 916, "intT": 917, "floatT": 918, "internally": 919, "cases": 920, "separate": 921, "replace": 922, "alternatively": 923, "below": 924, "until": 925, "columntypes": 926, "_setindex": 927, "Unicode": 928, "getpos": 929, "getlen": 930, "datalayout": 931, "div": 932, "errors": 933, "assume": 934, "keep": 935, "bvc": 936, "counts": 937, "Refs": 938, "parsemissing": 939, "adjust": 940, "extra": 941, "makeandsetpooled": 942, "tlcolrefs": 943, "consumecommentedline": 944, "dataset": 945, "correct": 946, "none": 947, "SUCCESS": 948, "sqlite": 949, "Size": 950, "top": 951, "missingvalue": 952, "meaning": 953, "columnname": 954, "writedelimnewline": 955, "codeunit": 956, "there": 957, "come": 958, "adjusting": 959, "RefValue": 960, "perthreadintsentinels": 961, "tlrows": 962, "TL": 963, "Quoted": 964, "fix": 965, "precompile": 966, "parsetape": 967, "option": 968, "TimeType": 969, "coltype": 970, "checkdelim": 971, "returning": 972, "level": 973, "typed": 974, "raw": 975, "default_format": 976, "ReentrantLock": 977, "lastparsedcode": 978, "ascii": 979, "Symbols": 980, "accessing": 981, "limiting": 982, "peekbyte": 983, "sum": 984, "parsecustom": 985, "signal": 986, "bits": 987, "point": 988, "collection": 989, "columnspecificpool": 990, "SentinelArrays": 991, "max": 992, "p": 993, "setting": 994, "truth": 995, "lastcode": 996, "add": 997, "commented": 998, "parsedanylines": 999, "matched": 1000, "cp": 1001, "ignore": 1002, "isfile": 1003, "lastbyte": 1004, "startingbyteposition": 1005, "endingbyteposition": 1006, "writebom": 1007, "inputs": 1008, "memset": 1009, "view": 1010, "simd": 1011, "foreach": 1012, "RefArray": 1013, "itself": 1014, "getordefault": 1015, "more": 1016, "locks": 1017, "few": 1018, "EOF": 1019, "ReturnCode": 1020, "newtapes": 1021, "T3": 1022, "isinttype": 1023, "token": 1024, "combination": 1025, "contiguous": 1026, "consistent": 1027, "tl_rows": 1028, "newintsent": 1029, "KW": 1030, "skipcells": 1031, "does": 1032, "finaltapes": 1033, "count": 1034, "pre": 1035, "Invalid": 1036, "structure": 1037, "msg": 1038, "syncrefs": 1039, "EMPTY_REFRECODE": 1040, "users": 1041, "isconcretetype": 1042, "detectdelimandguessrows": 1043, "Exception": 1044, "matrix": 1045, "performance": 1046, "memcmp": 1047, "under": 1048, "datalayout_transpose": 1049, "macro": 1050, "Int128": 1051, "own": 1052, "oldlen": 1053, "Cint": 1054, "getcolumnmap": 1055, "import": 1056, "know": 1057, "Filling": 1058, "remaining": 1059, "reach": 1060, "fatal": 1061, "RESERVED": 1062, "cleansed": 1063, "Non": 1064, "ts": 1065, "leftmost": 1066, "row_vals": 1067, "itr": 1068, "unless": 1069, "modify": 1070, "Set": 1071, "export": 1072, "see": 1073, "provides": 1074, "later": 1075, "TYPECODES": 1076, "unsafe_string": 1077, "_eltype": 1078, "least": 1079, "widen": 1080, "update": 1081, "ll": 1082, "revlen": 1083, "inference": 1084, "maxstringsize": 1085, "allocated": 1086, "O2": 1087, "M": 1088, "plain": 1089, "turn": 1090, "maxcnt": 1091, "missingref": 1092, "maximum": 1093, "gettypecodes": 1094, "typ": 1095, "truestring": 1096, "falsestring": 1097, "down": 1098, "assert": 1099, "_widen": 1100, "once": 1101, "newpos": 1102, "sent": 1103, "tl_refs": 1104, "close": 1105, "AbstractRow": 1106, "o": 1107, "custom": 1108, "fieldcount": 1109, "explicitly": 1110, "reinterp_func": 1111, "VALUE_BUFFERS": 1112, "existing": 1113, "refargs": 1114, "finaltype": 1115, "INT64": 1116, "head": 1117, "cfunction": 1118, "wholecolumnslock": 1119, "right": 1120, "windows": 1121, "particularly": 1122, "catg": 1123, "__init__": 1124, "sort": 1125, "FUNCTIONMAP": 1126, "compress": 1127, "promote_to_string": 1128, "might": 1129, "efficient": 1130, "avgbytesperrow": 1131, "origbytesperrow": 1132, "weightedavgbytesperrow": 1133, "Chunks": 1134, "Delimited": 1135, "order": 1136, "assigned": 1137, "utilize": 1138, "EMPTY_POSITIONS": 1139, "UnitRange": 1140, "DF": 1141, "_seekstart": 1142, "these": 1143, "widened": 1144, "run": 1145, "multi": 1146, "INT32": 1147, "headerbvc": 1148, "parsestring2": 1149, "SubArray": 1150, "property": 1151, "zip": 1152, "ncodeunits": 1153, "without": 1154, "typebits": 1155, "combined": 1156, "skiptoheader": 1157, "beginning": 1158, "list": 1159, "previous": 1160, "correctly": 1161, "B": 1162, "C": 1163, "finally": 1164, "To": 1165, "slightly": 1166, "lazily": 1167, "finished": 1168, "concrete_or_concreteunion": 1169, "Ignoring": 1170, "dtT": 1171, "dtmT": 1172, "tT": 1173, "chunking": 1174, "fail": 1175, "they": 1176, "endswith": 1177, "MAYBEPOOLED": 1178, "rowpositions": 1179, "memory": 1180, "including": 1181, "getvalue": 1182, "increase": 1183, "ValidSources": 1184, "special": 1185, "avg": 1186, "attempted": 1187, "fs": 1188, "CodecZlib": 1189, "AbstractFloat": 1190, "encodings": 1191, "JuliaStrings": 1192, "direct": 1193, "copying": 1194, "initialize": 1195, "estimate": 1196, "bad": 1197, "vectors": 1198, "strip": 1199, "necessary": 1200, "AbstractRange": 1201, "refvalues": 1202, "tables": 1203, "perthreadrows": 1204, "already": 1205, "unexpected": 1206, "track": 1207, "_unsafe_string": 1208, "True": 1209, "TRUE": 1210, "False": 1211, "FALSE": 1212, "trying": 1213, "typedetected": 1214, "op": 1215, "INTVALUE": 1216, "Field": 1217, "DummyIO": 1218, "parses": 1219, "contains": 1220, "unsafe_trunc": 1221, "copied": 1222, "getvalues": 1223, "Pooled": 1224, "always": 1225, "Response": 1226, "escapedvalue": 1227, "This": 1228, "generation": 1229, "meta": 1230, "available": 1231, "operations": 1232, "filedetection": 1233, "DEFAULT_POOL": 1234, "cld": 1235, "userprovidedtype": 1236, "both": 1237, "indices": 1238, "buffer_to_tempfile": 1239, "hash": 1240, "H": 1241, "INT8": 1242, "INT16": 1243, "dt2": 1244, "dt3": 1245, "fargs": 1246, "build": 1247, "WILLDROP": 1248, "small": 1249, "several": 1250, "unsafe_load": 1251, "yet": 1252, "stdlib": 1253, "getstring": 1254, "f2": 1255, "unsupported": 1256, "totalrows": 1257, "requires": 1258, "thrown": 1259, "newlines": 1260, "esc": 1261, "been": 1262, "logic": 1263, "NEEDSTYPEDETECTION": 1264, "reference": 1265, "totalbytes": 1266, "exist": 1267, "colopts": 1268, "detectedtypes": 1269, "IntValue": 1270, "ASCII": 1271, "makeposlen": 1272, "initialized": 1273, "columntype": 1274, "ending": 1275, "isrowtable": 1276, "its": 1277, "cmtptr": 1278, "ColumnProperties": 1279, "occurs": 1280, "limitposguess": 1281, "InlineString1": 1282, "InlineString3": 1283, "InlineString7": 1284, "InlineString15": 1285, "InlineString63": 1286, "dict": 1287, "detectcolumnnames": 1288, "made": 1289, "Callable": 1290, "EMPTY_REFS": 1291, "tl_poslens": 1292, "intern": 1293, "printcsv": 1294, "larger": 1295, "IteratorSize": 1296, "during": 1297, "unwrap": 1298, "dropped": 1299, "possible": 1300, "toomanywwarnings": 1301, "FLOAT64": 1302, "detecttranspose": 1303, "parameter": 1304, "invindex": 1305, "standard": 1306, "gzipped": 1307, "keys": 1308, "detectheaderdatapos": 1309, "C_NULL": 1310, "seeking": 1311, "even": 1312, "hasmissingtype": 1313, "making": 1314, "InlineString127": 1315, "isnan": 1316, "pooledvectype": 1317, "px": 1318, "nextsuffix": 1319, "Result": 1320, "takes": 1321, "mapped": 1322, "validation": 1323, "following": 1324, "allow": 1325, "holds": 1326, "incompatible": 1327, "version": 1328, "chunked": 1329, "gete": 1330, "store": 1331, "perthreadtypecodes": 1332, "foundsent": 1333, "oldintsent": 1334, "newposlens": 1335, "initialtype": 1336, "handle": 1337, "represent": 1338, "corresponding": 1339, "promote_typecode": 1340, "defaults": 1341, "current": 1342, "skipemptyrow": 1343, "adjustment": 1344, "present": 1345, "past": 1346, "Random": 1347, "detecttype": 1348, "res_int": 1349, "res_float": 1350, "res_date": 1351, "res_datetime": 1352, "res_dt": 1353, "res_bool": 1354, "NTuple": 1355, "_inline_meta": 1356, "posx": 1357, "u": 1358, "automatically": 1359, "endpositions": 1360, "obj": 1361, "partition": 1362, "Downloads": 1363, "detectcell": 1364, "Float16": 1365, "Float32": 1366, "wrong": 1367, "column_to_promote": 1368, "setmissing": 1369, "take": 1370, "times": 1371, "materializing": 1372, "stringsonly": 1373, "kicks": 1374, "VALUE_BUFFER": 1375, "quoting": 1376, "printing": 1377, "numbers": 1378, "actually": 1379, "_parseany": 1380, "went": 1381, "arrays": 1382, "num": 1383, "controls": 1384, "endpos": 1385, "IG": 1386, "currentrow": 1387, "Sentinel": 1388, "Strip": 1389, "promotevectype": 1390, "global": 1391, "far": 1392, "encoding": 1393, "INT_SENTINEL": 1394, "dummy": 1395, "guessnrows": 1396, "outfiles": 1397, "cleanup": 1398, "finicky": 1399, "throwing": 1400, "surprises": 1401, "had": 1402, "newsentinel": 1403, "InlineString31": 1404, "Pair": 1405, "getpool": 1406, "T4": 1407, "due": 1408, "whole": 1409, "tokens": 1410, "Y": 1411, "ignoring": 1412, "escaped": 1413, "deduce": 1414, "put": 1415, "Parses": 1416, "whitespacedelim": 1417, "iterator": 1418, "produces": 1419, "needs": 1420, "further": 1421, "lazy": 1422, "accessible": 1423, "inverse": 1424, "inside": 1425, "find": 1426, "Checks": 1427, "got": 1428, "array_i": 1429, "usermissing": 1430, "NEWLINE": 1431, "floating": 1432, "since": 1433, "amongst": 1434, "arr": 1435, "backwards": 1436, "GC": 1437, "main": 1438, "total": 1439, "utils": 1440, "unpool": 1441, "pooledvalues": 1442, "LAZYSTRINGS": 1443, "resize_nthreads": 1444, "quotefields": 1445, "output": 1446, "needing": 1447, "vertically": 1448, "their": 1449, "endposition": 1450, "kws": 1451, "baremodule": 1452, "normalize": 1453, "isidentifier": 1454, "is_id_char": 1455, "is_id_start_char": 1456, "usage": 1457, "joinpath": 1458, "ed": 1459, "sentinels": 1460, "CategoricalValue": 1461, "SENTINEL": 1462, "perthreadposlens": 1463, "array_index": 1464, "checkvalidsource": 1465, "gettape": 1466, "AtomicVector": 1467, "typedetection": 1468, "reset": 1469, "unknown": 1470, "won": 1471, "through": 1472, "vs": 1473, "JULIA_NUM_THREADS": 1474, "environment": 1475, "variable": 1476, "very": 1477, "average": 1478, "implemented": 1479, "selected": 1480, "finalpool": 1481, "test": 1482, "testfiles": 1483, "across": 1484, "seekstart": 1485, "whatever": 1486, "ISO": 1487, "higher": 1488, "inferring": 1489, "DELIMITED": 1490, "nothingerror": 1491, "enc": 1492, "reporting": 1493, "InlineString255": 1494, "DEFAULT_MAX_INLINE_STRING_LENGTH": 1495, "POSLEN_MISSING": 1496, "pooledtype": 1497, "AT": 1498, "tfile1": 1499, "StringVector": 1500, "providing": 1501, "_not_": 1502, "affect": 1503, "creating": 1504, "hopefully": 1505, "null": 1506, "emtpy": 1507, "included": 1508, "chararacters": 1509, "unescaped": 1510, "tl_len": 1511, "m2": 1512, "perthreadrefs": 1513, "perthreadlastrefs": 1514, "tl_lastrefs": 1515, "tl_intsentinels": 1516, "anyintrecode": 1517, "tlrefs": 1518, "tllastrefs": 1519, "tlposlens": 1520, "foundnewsent": 1521, "INVALID_DELIMITERS": 1522, "NONINTVALUE": 1523, "INT_BIT": 1524, "eachcolumn": 1525, "acc": 1526, "reallocating": 1527, "xT": 1528, "started": 1529, "cardinality": 1530, "lead": 1531, "succeeded": 1532, "cushion": 1533, "shooting": 1534, "guarantee": 1535, "invert": 1536, "pick": 1537, "indexed": 1538, "written": 1539, "TF": 1540, "again": 1541, "above": 1542, "TRUE_STRINGS": 1543, "FALSE_STRINGS": 1544, "back": 1545, "pickstringtype": 1546, "issues": 1547, "utilities": 1548, "AbstractPath": 1549, "successfullychunked": 1550, "getoptions": 1551, "long": 1552, "stripwhitespace": 1553, "happen": 1554, "merge": 1555, "integer": 1556, "spawned": 1557, "PRECOMPILE_DATA": 1558, "conversion": 1559, "includes": 1560, "gettranspose": 1561, "zero": 1562, "unhandled": 1563, "Intger": 1564, "mode": 1565, "oldtapes": 1566, "newtapelen": 1567, "randomly": 1568, "rows_for_type_detect": 1569, "dot": 1570, "KEYWORD_DOCS": 1571, "rm": 1572, "chaincolumns": 1573, "still": 1574, "memhash_seed": 1575, "memhash": 1576, "preserve": 1577, "those": 1578, "makes": 1579, "makepooled": 1580, "Calling": 1581, "Also": 1582, "closed": 1583, "undefined": 1584, "behavior": 1585, "caveats": 1586, "help": 1587, "lots": 1588, "allocations": 1589, "initialflags": 1590, "getdf": 1591, "basic": 1592, "lt": 1593, "eachindex": 1594, "ncol": 1595, "existing_df": 1596, "READLINE_RESULT": 1597, "trytype": 1598, "applied": 1599, "dataframe": 1600, "DEFAULT_ROWS_TO_CHECK": 1601, "DEFAULT_STRINGTYPE": 1602, "DEFAULT_MAX_WARNINGS": 1603, "second": 1604, "specifically": 1605, "buffered": 1606, "Use": 1607, "conjunction": 1608, "No": 1609, "advanced": 1610, "ops": 1611, "OPTIONS": 1612, "tsv": 1613, "wsv": 1614, "sampled": 1615, "release": 1616, "Write": 1617, "representing": 1618, "appending": 1619, "allowing": 1620, "rowchunkoffset": 1621, "hasn": 1622, "ever": 1623, "reallocatecolumns": 1624, "cellstartpos": 1625, "trytopromote": 1626, "fl2": 1627, "colnm": 1628, "isinttypecode": 1629, "rowstartpos": 1630, "generally": 1631, "tl_types": 1632, "definitions": 1633, "iscntrl": 1634, "control": 1635, "internstrings": 1636, "streamfrom": 1637, "InlineStringType": 1638, "suggested": 1639, "applicable": 1640, "prints": 1641, "Whether": 1642, "Throws": 1643, "never": 1644, "bufferedwrite": 1645, "__DIR__": 1646, "test_utf8": 1647, "rand": 1648, "buffertoosmall": 1649, "best": 1650, "method": 1651, "promote_type": 1652, "isbitstype": 1653, "getbytebuffer": 1654, "TranscodingStreams": 1655, "Noop": 1656, "GzipDecompressor": 1657, "codec": 1658, "HARDMISSING": 1659, "smallestint": 1660, "safe": 1661, "various": 1662, "columnprops": 1663, "NaN": 1664, "strnomiss": 1665, "cmd": 1666, "categoricalpools": 1667, "skipping": 1668, "multithreadpostparse": 1669, "chosen": 1670, "ambiguity": 1671, "liner": 1672, "ScottPJones": 1673, "_after_": 1674, "efficiently": 1675, "information": 1676, "checkinvalidcolumns": 1677, "argname": 1678, "formats": 1679, "occursin": 1680, "Each": 1681, "While": 1682, "identical": 1683, "concurrently": 1684, "Given": 1685, "wrapping": 1686, "columsn": 1687, "optimize": 1688, "getcoloptions": 1689, "ms": 1690, "tot": 1691, "float64": 1692, "rng": 1693, "pt": 1694, "rem": 1695, "copies": 1696, "concatenate": 1697, "issue": 1698, "TODO": 1699, "unsafe_wrap": 1700, "iterated": 1701, "remove": 1702, "tracked": 1703, "things": 1704, "metadata": 1705, "well": 1706, "misshapen": 1707, "Columns": 1708, "TTY": 1709, "Pipe": 1710, "PipeEndpoint": 1711, "silencing": 1712, "isfinite": 1713, "why": 1714, "off": 1715, "lineschecked": 1716, "autocols": 1717, "push_level": 1718, "columnindex": 1719, "cpool": 1720, "Only": 1721, "firstarray": 1722, "py": 1723, "StringCodeUnits": 1724, "Format": 1725, "built": 1726, "scanned": 1727, "footprint": 1728, "setcustom": 1729, "threadedprocesscolumn": 1730, "colrefpool": 1731, "taskrefpool": 1732, "tl_flags": 1733, "tl_datapos": 1734, "tltypecodes": 1735, "printheader": 1736, "Positional": 1737, "fib": 1738, "DevNull": 1739, "nexprs": 1740, "l": 1741, "ndigits": 1742, "oftype": 1743, "IEEEFloat": 1744, "neededdigits": 1745, "writeshortest": 1746, "unsafe_convert": 1747, "strlen": 1748, "Cstring": 1749, "generic": 1750, "fallback": 1751, "AbstractArray": 1752, "processcolumn": 1753, "often": 1754, "columnset": 1755, "treat": 1756, "somehow": 1757, "everything": 1758, "normalizing": 1759, "meant": 1760, "U": 1761, "assuming": 1762, "char": 1763, "forward": 1764, "chars": 1765, "justify": 1766, "reduce": 1767, "FilePathsBase": 1768, "path": 1769, "determines": 1770, "EMPTY_REFVALUES": 1771, "neg": 1772, "location": 1773, "future": 1774, "columntable": 1775, "part": 1776, "results": 1777, "ensures": 1778, "nonmissingtypeunlessmissingtype": 1779, "jl_pchar_to_string": 1780, "split": 1781, "desired": 1782, "stores": 1783, "necessarily": 1784, "correlate": 1785, "attempt": 1786, "unlock": 1787, "removed": 1788, "mask": 1789, "TYPEBITS": 1790, "happens": 1791, "TableOperations": 1792, "CodeUnits": 1793, "checkpooled": 1794, "nrows": 1795, "reasons": 1796, "UInt16": 1797, "certain": 1798, "sampling": 1799, "methods": 1800, "avoiding": 1801, "unbuffered": 1802, "pipe": 1803, "sense": 1804, "multithread": 1805, "gettapes": 1806, "immutable": 1807, "ismissing": 1808, "chunkrows": 1809, "hasmethod": 1810, "decompressed": 1811, "checks": 1812, "processing": 1813, "define": 1814, "kernel": 1815, "risk": 1816, "collision": 1817, "representation": 1818, "thing": 1819, "indexes": 1820, "bottom": 1821, "skips": 1822, "expression": 1823, "tries": 1824, "nonconcretetypes": 1825, "reparsing": 1826, "confirming": 1827, "istable": 1828, "upfront": 1829, "simultaneously": 1830, "common": 1831, "bufferedescape": 1832, "rowoff": 1833, "DataStreams": 1834, "makedf": 1835, "makestr": 1836, "countlines": 1837, "colinds": 1838, "defaultstringtype": 1839, "creates": 1840, "regular": 1841, "trailing": 1842, "keywords": 1843, "parsedncols": 1844, "String1": 1845, "tradeoffs": 1846, "Very": 1847, "minimal": 1848, "Performs": 1849, "essentially": 1850, "performant": 1851, "SizeUnknown": 1852, "much": 1853, "bunch": 1854, "patterns": 1855, "Compiler": 1856, "typesubtract": 1857, "bug": 1858, "us": 1859, "slurp": 1860, "standardize": 1861, "storing": 1862, "Fib": 1863, "calculate": 1864, "concurrent": 1865, "give": 1866, "matches": 1867, "TYPES": 1868, "scans": 1869, "tracks": 1870, "showed": 1871, "frequency": 1872, "normalization": 1873, "splitting": 1874, "equally": 1875, "spaced": 1876, "verify": 1877, "move": 1878, "Atomic": 1879, "haystack": 1880, "needle": 1881, "docs": 1882, "multithreading": 1883, "det": 1884, "boom": 1885, "worse": 1886, "shouldn": 1887, "identifying": 1888, "middle": 1889, "hit": 1890, "likely": 1891, "corrupt": 1892, "unquoted": 1893, "misquoted": 1894, "ask": 1895, "tell": 1896, "stability": 1897, "looping": 1898, "recoding": 1899, "convenient": 1900, "stored": 1901, "tl_pos": 1902, "cx": 1903, "getrefs": 1904, "slots": 1905, "major": 1906, "linearly": 1907, "noting": 1908, "initially": 1909, "gets": 1910, "pdigits": 1911, "Minimal": 1912, "problematic": 1913, "equals": 1914, "kk": 1915, "custom_prefix": 1916, "ignore_repeated": 1917, "ignore_repeated_delimiters": 1918, "partitions": 1919, "printable": 1920, "There": 1921, "ways": 1922, "situation": 1923, "perhaps": 1924, "groupmark": 1925, "definition": 1926, "stay": 1927, "Regex": 1928, "care": 1929, "MAX_INPUT_SIZE": 1930, "chance": 1931, "accurately": 1932, "high": 1933, "iel": 1934, "array_lens": 1935, "roundup": 1936, "less": 1937, "READSPLITLINE_RESULT": 1938, "infer": 1939, "low": 1940, "_identity": 1941, "needtoclose": 1942, "underlying": 1943, "emit": 1944, "stable": 1945, "states": 1946, "element": 1947, "printed": 1948, "Iteration": 1949, "reused": 1950, "NLINES": 1951, "origcoltypes": 1952, "rowsparsed": 1953, "_precompile_": 1954, "falling": 1955, "TempFileWrapper": 1956, "maps": 1957, "taskrefs": 1958, "makepooled2": 1959, "unpool2": 1960, "consider": 1961, "doff": 1962, "escapedstringtype": 1963, "DELIM_NEWLINE": 1964, "piping": 1965, "oq8": 1966, "cq8": 1967, "lightweight": 1968, "Satisfies": 1969, "unnecessary": 1970, "intermediate": 1971, "wraps": 1972, "downloaded": 1973, "download": 1974, "Or": 1975, "subtypes": 1976, "integers": 1977, "ended": 1978, "ve": 1979, "finish": 1980, "ChainedVectors": 1981, "quick": 1982, "likewise": 1983, "uninitialized": 1984, "temp": 1985, "derived": 1986, "purposes": 1987, "emits": 1988, "compute": 1989, "pretty": 1990, "shared": 1991, "belongs": 1992, "keeping": 1993, "bumped": 1994, "cycled": 1995, "encoded": 1996, "depending": 1997, "percent": 1998, "widening": 1999, "ultimate": 2000, "hope": 2001, "outline": 2002, "fall": 2003, "tuple": 2004, "parser": 2005, "attempted_quoted": 2006, "f40": 2007, "typs": 2008, "automatic": 2009, "keytype": 2010, "sample": 2011, "finalizebuffer": 2012, "rowaccess": 2013, "rowsv": 2014, "rs": 2015, "unsafe_write": 2016, "coalesce": 2017, "constructed": 2018, "isdone": 2019, "writeheaders": 2020, "streamto": 2021, "strtype": 2022, "Alternatively": 2023, "producing": 2024, "Creates": 2025, "unable": 2026, "dropping": 2027, "eventually": 2028, "implies": 2029, "userprovided": 2030, "proper": 2031, "buffering": 2032, "gunzip": 2033, "transcode": 2034, "mktemp": 2035, "TranscodingStream": 2036, "DetectTypes": 2037, "Arguments": 2038, "equal": 2039, "checked": 2040, "finds": 2041, "anything": 2042, "concretely": 2043, "such": 2044, "core": 2045, "buffers": 2046, "integration": 2047, "determing": 2048, "memcpy": 2049, "getcategorical": 2050, "rowidx": 2051, "Keyword": 2052, "interned": 2053, "file_or_io": 2054, "construct": 2055, "streamed": 2056, "df1": 2057, "sq1": 2058, "weakref": 2059, "X": 2060, "Transforms": 2061, "print_matrix": 2062, "hcat": 2063, "When": 2064, "Separate": 2065, "IdDict": 2066, "descend": 2067, "writer": 2068, "container": 2069, "upon": 2070, "construction": 2071, "schematype": 2072, "anyway": 2073, "helpful": 2074, "authors": 2075, "investigate": 2076, "StringVec": 2077, "ThreadedIterationState": 2078, "array_len": 2079, "FUNC_ANY": 2080, "funcs": 2081, "propertly": 2082, "machine": 2083, "compression": 2084, "missingvectype": 2085, "invpool": 2086, "apart": 2087, "outermost": 2088, "easiest": 2089, "compressed": 2090, "cleaned": 2091, "uncompressed": 2092, "removal": 2093, "post": 2094, "plen": 2095, "cp2": 2096, "account": 2097, "context": 2098, "abc": 2099, "InlineStrings": 2100, "CopiedColumns": 2101, "thus": 2102, "vT": 2103, "checkwidencolumns": 2104, "ct": 2105, "getV": 2106, "getstringtype": 2107, "along": 2108, "incremented": 2109, "ignoreemtpylines": 2110, "fullrows": 2111, "colposlens": 2112, "previously": 2113, "discovering": 2114, "appropriate": 2115, "throws": 2116, "AtomicTypes": 2117, "ilt": 2118, "refsv": 2119, "lastrefsv": 2120, "lrs": 2121, "Grisu": 2122, "iosource": 2123, "fieldindex": 2124, "dates": 2125, "datetimes": 2126, "getfunc": 2127, "prevfib": 2128, "COMMA_NEWLINES": 2129, "col3": 2130, "gzip": 2131, "widest": 2132, "pair": 2133, "__wrap": 2134, "requested": 2135, "primitive": 2136, "findchunkrowstart": 2137, "findnextnewline": 2138, "stop": 2139, "gc": 2140, "internal": 2141, "basically": 2142, "enum": 2143, "UTD": 2144, "UTM": 2145, "code_typed": 2146, "implementation": 2147, "trunc": 2148, "smallestline": 2149, "convenience": 2150, "mat": 2151, "rather": 2152, "_firstmatch": 2153, "excessive": 2154, "roughly": 2155, "atomic_add": 2156, "wah": 2157, "pooling": 2158, "defaultT": 2159, "dirname": 2160, "pathof": 2161, "reads": 2162, "Here": 2163, "ExampleOutputDF": 2164, "objects": 2165, "unrollcolumns": 2166, "poolval": 2167, "ir": 2168, "samples": 2169, "pooled_column": 2170, "soff": 2171, "getarrayindex": 2172, "getarrayi": 2173, "typemin": 2174, "findfirst": 2175, "_reset": 2176, "intvalue": 2177, "EMPTY_LAST_REFS": 2178, "EMPTY_CATEGORICAL_POOLS": 2179, "parseempty": 2180, "exception": 2181, "stacktrace": 2182, "catch_backtrace": 2183, "lengths": 2184, "getsetInt": 2185, "getsetFloat": 2186, "getsetDate": 2187, "getsetDateTime": 2188, "getsetBool": 2189, "getsetString": 2190, "getsetMissing": 2191, "getsetWeakRefString": 2192, "getsetCatStr": 2193, "getsetAny": 2194, "escapes": 2195, "missingcheck": 2196, "satisfies": 2197, "repl": 2198, "An": 2199, "begins": 2200, "bytesavailable": 2201, "originalcolumnpositions": 2202, "catvaluetype": 2203, "EMPTY_UINT8_ARRAY": 2204, "initialize_column": 2205, "hold": 2206, "finalizer": 2207, "pooltype": 2208, "rowtable": 2209, "tracking": 2210, "fastpath": 2211, "escaping": 2212, "base": 2213, "totalmissing": 2214, "mb": 2215, "increments": 2216, "readbytes": 2217, "Nanosecond": 2218, "tapesv": 2219, "trefs": 2220, "tlastrefs": 2221, "rngs": 2222, "recodes": 2223, "tps": 2224, "valind": 2225, "TYPEMAP": 2226, "initialization": 2227, "providedtypes": 2228, "prep": 2229, "startingrow": 2230, "schema_names": 2231, "ISODateTimeFormat": 2232, "recognize": 2233, "cannot": 2234, "GzipCompressorStream": 2235, "wkspawn": 2236, "noticed": 2237, "reached": 2238, "spurious": 2239, "chose": 2240, "columnlock": 2241, "Internal": 2242, "Fields": 2243, "missingness": 2244, "definitely": 2245, "affects": 2246, "mutated": 2247, "switches": 2248, "synchronizing": 2249, "changes": 2250, "shares": 2251, "child": 2252, "_share_": 2253, "_don": 2254, "t_": 2255, "fresh": 2256, "nonstandard": 2257, "devdoc": 2258, "n1": 2259, "promotions": 2260, "sinks": 2261, "Example": 2262, "Returns": 2263, "Accepts": 2264, "explanations": 2265, "defaulting": 2266, "independent": 2267, "significant": 2268, "functionality": 2269, "experimental": 2270, "problems": 2271, "bugs": 2272, "expressiong": 2273, "however": 2274, "replacing": 2275, "PosLenStrings": 2276, "handled": 2277, "vcat": 2278, "mismatch": 2279, "think": 2280, "seeing": 2281, "incorrectly": 2282, "pad": 2283, "atomictypes": 2284, "llvmtypes": 2285, "rt": 2286, "eval": 2287, "llvmcall": 2288, "inttoptr": 2289, "WORD_SIZE": 2290, "rv": 2291, "atomic": 2292, "align": 2293, "gc_alignment": 2294, "crefs": 2295, "Process": 2296, "metaind": 2297, "setchunk": 2298, "BufferedIO": 2299, "identity": 2300, "complete": 2301, "speed": 2302, "WeakRefStringArray": 2303, "col2": 2304, "file2": 2305, "xor": 2306, "setup": 2307, "implement": 2308, "indexable": 2309, "appended": 2310, "iterable": 2311, "filenames": 2312, "according": 2313, "positive": 2314, "Do": 2315, "towards": 2316, "completely": 2317, "elements": 2318, "initial_column_type": 2319, "potentially": 2320, "friendly": 2321, "String3": 2322, "String7": 2323, "String15": 2324, "String31": 2325, "String63": 2326, "String127": 2327, "String255": 2328, "unzipping": 2329, "structured": 2330, "constants": 2331, "keyworddocs": 2332, "Allows": 2333, "getfinaltypes": 2334, "probably": 2335, "funciton": 2336, "jl_arrayunset": 2337, "deleting": 2338, "getignorerepeated": 2339, "round": 2340, "largest": 2341, "pagesize": 2342, "aligns": 2343, "PAGESIZE": 2344, "setchunkm": 2345, "AccessStyle": 2346, "RowAccess": 2347, "Ryu": 2348, "Multithreaded": 2349, "fell": 2350, "calls": 2351, "settings": 2352, "Valid": 2353, "int_float": 2354, "hey": 2355, "clear_thread_states": 2356, "_Returns": 2357, "flexibility": 2358, "kind": 2359, "stick": 2360, "short": 2361, "luckily": 2362, "working": 2363, "reserved": 2364, "singleton": 2365, "signaling": 2366, "being": 2367, "LazyStringVectors": 2368, "score": 2369, "MoE": 2370, "ing": 2371, "specialize": 2372, "SystemPath": 2373, "gettype": 2374, "required": 2375, "ttapes": 2376, "tdatapos": 2377, "WARNING": 2378, "preallocated": 2379, "escapedstrings": 2380, "EMPTY_LEVELS": 2381, "EMPTY_POOLS": 2382, "MAX_ROWS": 2383, "getparsedvalue": 2384, "TransformsRow": 2385, "res_str": 2386, "Z": 2387, "cv": 2388, "moe": 2389, "samplesize": 2390, "Examples": 2391, "Support": 2392, "edge": 2393, "Right": 2394, "specialised": 2395, "log": 2396, "works": 2397, "parameters": 2398, "Memory": 2399, "normal": 2400, "seems": 2401, "figured": 2402, "waaaah": 2403, "tried": 2404, "outside": 2405, "_inside_": 2406, "seem": 2407, "expecting": 2408, "bail": 2409, "way": 2410, "facing": 2411, "fast": 2412, "flexible": 2413, "reader": 2414, "Reading": 2415, "thereby": 2416, "lower": 2417, "extremely": 2418, "batches": 2419, "Writing": 2420, "writes": 2421, "ExampleInputDF": 2422, "ExampleInputFile": 2423, "ExampleOutputFile": 2424, "setfield": 2425, "scan": 2426, "GenericIOBuffer": 2427, "Despite": 2428, "Number": 2429, "oldtape": 2430, "EscapedString": 2431, "offsets": 2432, "rowstr": 2433, "Represents": 2434, "configuration": 2435, "public": 2436, "positioned": 2437, "deprecations": 2438, "throughout": 2439, "better": 2440, "__IO__": 2441, "filesize": 2442, "BOOLS": 2443, "Detect": 2444, "DataType": 2445, "problem": 2446, "Unions": 2447, "tdetecting": 2448, "entries": 2449, "indexin": 2450, "setdiff": 2451, "disallow": 2452, "ready": 2453, "accesspattern": 2454, "Sequential": 2455, "streamtype": 2456, "streamtypes": 2457, "weakrefstrings": 2458, "Constructors": 2459, "plus": 2460, "apply": 2461, "invocations": 2462, "tab": 2463, "Character": 2464, "forms": 2465, "statement": 2466, "wrap": 2467, "smallest": 2468, "nature": 2469, "going": 2470, "nextrowpos": 2471, "numcolsthisrow": 2472, "new_last_idx": 2473, "isvalid": 2474, "additional": 2475, "n2": 2476, "basename": 2477, "precompile_small": 2478, "today": 2479, "tempname": 2480, "Column3": 2481, "storage": 2482, "stats": 2483, "gc_num": 2484, "Matrix": 2485, "_code": 2486, "mss": 2487, "UndefInitializer": 2488, "unselected": 2489, "EMPTY_POSLENS": 2490, "EMPTY_LASTREFS": 2491, "getintsentinels": 2492, "structures": 2493, "inttype": 2494, "irt": 2495, "acquire": 2496, "void": 2497, "xs": 2498, "split_sign": 2499, "issorted": 2500, "nt": 2501, "colums": 2502, "affected": 2503, "Windows": 2504, "machines": 2505, "deletable": 2506, "seen": 2507, "dramatically": 2508, "interning": 2509, "disabled": 2510, "quinnj": 2511, "bids": 2512, "bid_id": 2513, "bidder_id": 2514, "auction": 2515, "merchandise": 2516, "device": 2517, "ewmzr": 2518, "jewelry": 2519, "phone0": 2520, "aeqok": 2521, "furniture": 2522, "phone1": 2523, "aa5f360084278b35d746fa6af3a7a1a5ra3xe": 2524, "wa00e": 2525, "home": 2526, "goods": 2527, "phone2": 2528, "Other": 2529, "MySQL": 2530, "grouped": 2531, "assumes": 2532, "though": 2533, "col6": 2534, "known": 2535, "beforehand": 2536, "improve": 2537, "unroll": 2538, "JuliaLang": 2539, "messages": 2540, "echo": 2541, "report": 2542, "determined": 2543, "syntax": 2544, "cause": 2545, "serially": 2546, "smaller": 2547, "sequential": 2548, "_all_": 2549, "ultimately": 2550, "helps": 2551, "heap": 2552, "longer": 2553, "acts": 2554, "original": 2555, "It": 2556, "keeps": 2557, "informational": 2558, "figuring": 2559, "addtrailingcolumn": 2560, "newranges": 2561, "reinitialize_column_type": 2562, "Putting": 2563, "loading": 2564, "precompiled": 2565, "regardless": 2566, "belong": 2567, "dictcolumntable": 2568, "SnoopPrecompile": 2569, "precompile_all_calls": 2570, "running": 2571, "jl_generating_output": 2572, "FIXME": 2573, "float16": 2574, "float32": 2575, "clause": 2576, "LazyArrays": 2577, "ApplyArray": 2578, "master": 2579, "aggregating": 2580, "BigFloat": 2581, "isinf": 2582, "Inf": 2583, "DIGITSs": 2584, "grisu": 2585, "SHORTEST": 2586, "newtape": 2587, "QS": 2588, "StringArray": 2589, "allocatecolumn": 2590, "tablesize": 2591, "ExpectedMoreColumnsError": 2592, "src": 2593, "CI": 2594, "margin": 2595, "statistical": 2596, "seed": 2597, "Iterators": 2598, "flatten": 2599, "Base.string": 2600, "These": 2601, "containing": 2602, "generates": 2603, "temporary": 2604, "As": 2605, "added": 2606, "ends": 2607, "condition": 2608, "Create": 2609, "initialize_columns": 2610, "having": 2611, "PrecompileTools": 2612, "compile_workload": 2613, "foo": 2614, "bar": 2615, "precompile_setup": 2616, "getting": 2617, "stuck": 2618, "clears": 2619, "clear": 2620, "Timer": 2621, "interval": 2622, "pertaskcolumn": 2623, "refpools": 2624, "diff": 2625, "GC_Diff": 2626, "stage": 2627, "kwftype": 2628, "SpinLock": 2629, "views": 2630, "hence": 2631, "compact": 2632, "BroadcastStyle": 2633, "broadcasted": 2634, "mapreduce": 2635, "mapfoldl": 2636, "BoundsError": 2637, "unescaping": 2638, "tapeincr": 2639, "ints": 2640, "intsm": 2641, "floatsm": 2642, "datesm": 2643, "datetimesm": 2644, "boolsm": 2645, "makecolumn": 2646, "finalcolumn": 2647, "finaltypecodes": 2648, "badcolumnerror": 2649, "TooManyColumnsError": 2650, "CSV.write": 2651, "Base.propertynames": 2652, "Reads": 2653, "returs": 2654, "semi": 2655, "random": 2656, "NA": 2657, "twice": 2658, "sqlite_source": 2659, "__init": 2660}