{"<PAD>": 0, "<UNK>": 1, "x": 2, "pos": 3, "end": 4, "JSON": 5, "T": 6, "the": 7, "a": 8, "buf": 9, "to": 10, "return": 11, "if": 12, "is": 13, "for": 14, "opts": 15, "StructUtils": 16, "type": 17, "UInt8": 18, "String": 19, "obj": 20, "value": 21, "struct": 22, "be": 23, "nothing": 24, "io": 25, "f": 26, "true": 27, "key": 28, "function": 29, "of": 30, "false": 31, "b": 32, "Object": 33, "and": 34, "in": 35, "Base": 36, "json": 37, "elseif": 38, "Type": 39, "field": 40, "where": 41, "i": 42, "null": 43, "as": 44, "val": 45, "style": 46, "Int": 47, "Any": 48, "n": 49, "are": 50, "Union": 51, "bufsize": 52, "string": 53, "or": 54, "omit_null": 55, "that": 56, "K": 57, "Bool": 58, "inbounds": 59, "default": 60, "jsonlines": 61, "V": 62, "we": 63, "expr": 64, "parse": 65, "omit_empty": 66, "pretty": 67, "JSONTypes": 68, "an": 69, "else": 70, "will": 71, "JSONStyle": 72, "lift": 73, "The": 74, "lower": 75, "Percent": 76, "object": 77, "with": 78, "isa": 79, "y": 80, "Symbol": 81, "array": 82, "output": 83, "LazyValue": 84, "it": 85, "error": 86, "name": 87, "invalid": 88, "checkn": 89, "If": 90, "Float64": 91, "Nothing": 92, "ps": 93, "kw": 94, "throw": 95, "st": 96, "by": 97, "so": 98, "empty": 99, "this": 100, "len": 101, "from": 102, "num": 103, "_": 104, "IO": 105, "allownan": 106, "which": 107, "types": 108, "ArgumentError": 109, "typeof": 110, "AbstractString": 111, "not": 112, "JSONText": 113, "fields": 114, "s": 115, "notset": 116, "N": 117, "v": 118, "inf": 119, "used": 120, "float_style": 121, "custom": 122, "sizeof": 123, "can": 124, "nan": 125, "root": 126, "written": 127, "definition": 128, "k": 129, "macro": 130, "non": 131, "c": 132, "StructStyle": 133, "must": 134, "when": 135, "Integer": 136, "parsing": 137, "bytes": 138, "convert": 139, "fs": 140, "For": 141, "Vector": 142, "getbyte": 143, "keys": 144, "Meta": 145, "isexpr": 146, "_string": 147, "arraylike": 148, "lowerkey": 149, "dicttype": 150, "val1": 151, "serialized": 152, "Number": 153, "arrays": 154, "float_precision": 155, "goto": 156, "file": 157, "has": 158, "values": 159, "Dict": 160, "use": 161, "write": 162, "sizeguess": 163, "str": 164, "LazyValues": 165, "O": 166, "_ch": 167, "indent": 168, "set": 169, "Inf": 170, "NaN": 171, "while": 172, "like": 173, "e": 174, "ind": 175, "PtrString": 176, "number": 177, "AbstractMonster": 178, "julia": 179, "should": 180, "any": 181, "input": 182, "length": 183, "objects": 184, "instead": 185, "sz": 186, "tags": 187, "nextbyte": 188, "args": 189, "representation": 190, "skip": 191, "lazy": 192, "included": 193, "This": 194, "depth": 195, "parsefile": 196, "AbstractDict": 197, "shortest": 198, "at": 199, "on": 200, "defined": 201, "ninf": 202, "t": 203, "out": 204, "OBJECT": 205, "getpos": 206, "Infinity": 207, "codeunit": 208, "Ryu": 209, "ref": 210, "defaults": 211, "_extract_type_name": 212, "inline_limit": 213, "buffer": 214, "ancestor_stack": 215, "check": 216, "node": 217, "new": 218, "Int64": 219, "via": 220, "example": 221, "using": 222, "format": 223, "method": 224, "child": 225, "inline": 226, "ARRAY": 227, "tag": 228, "It": 229, "get": 230, "j": 231, "undef": 232, "quote": 233, "sym": 234, "how": 235, "make": 236, "typ": 237, "AbstractArray": 238, "all": 239, "allows": 240, "nested": 241, "noinline": 242, "Controls": 243, "MyStyle": 244, "macros": 245, "omit_func_name": 246, "fixed": 247, "tostring": 248, "WriteOptions": 249, "wroteany": 250, "al": 251, "Missing": 252, "Tuple": 253, "only": 254, "overload": 255, "Ptr": 256, "esc": 257, "then": 258, "filename": 259, "_k": 260, "being": 261, "other": 262, "missing": 263, "writing": 264, "into": 265, "Dracula": 266, "franken_type": 267, "monster_type": 268, "pre": 269, "id": 270, "data": 271, "Note": 272, "iterate": 273, "jl": 274, "was": 275, "num_victims": 276, "float": 277, "case": 278, "JSONReadStyle": 279, "gettype": 280, "expression": 281, "original_expr": 282, "result": 283, "each": 284, "exp": 285, "fname": 286, "need": 287, "DEFAULT_OBJECT_TYPE": 288, "Pair": 289, "whether": 290, "In": 291, "returns": 292, "supported": 293, "called": 294, "kv": 295, "pairs": 296, "address": 297, "rate": 298, "notsure": 299, "monster": 300, "percent": 301, "birthdate": 302, "percentages": 303, "json_properties": 304, "matrix": 305, "BigInt": 306, "AbstractVector": 307, "also": 308, "find": 309, "behavior": 310, "oc": 311, "keyword": 312, "appropriate": 313, "insert": 314, "allow": 315, "include": 316, "applyeach": 317, "valid": 318, "getbuf": 319, "tuple": 320, "Use": 321, "size": 322, "liftkey": 323, "FrankenStruct": 324, "fp": 325, "I": 326, "break": 327, "choosetype": 328, "r": 329, "getindex": 330, "Float16": 331, "Float32": 332, "neededdigits": 333, "Dates": 334, "undefined": 335, "Override": 336, "is_empty": 337, "Case": 338, "block": 339, "printing": 340, "integer": 341, "Custom": 342, "first": 343, "before": 344, "over": 345, "no": 346, "WriteClosure": 347, "JS": 348, "track_ref": 349, "is_circ_ref": 350, "local_ind": 351, "re": 352, "split_sign": 353, "STRING": 354, "m": 355, "NumberResult": 356, "Null": 357, "Omit": 358, "NamedTuple": 359, "base": 360, "l": 361, "omit": 362, "have": 363, "order": 364, "names": 365, "etc": 366, "mutable": 367, "vampire": 368, "Date": 369, "Matrix": 370, "open": 371, "const": 372, "doc": 373, "parsestring": 374, "int": 375, "bigint": 376, "bigfloat": 377, "isroot": 378, "keyvalfunc": 379, "ret": 380, "view": 381, "just": 382, "directly": 383, "would": 384, "witching_hour": 385, "yyyy": 386, "mm": 387, "dd": 388, "parent": 389, "byte": 390, "isvalidjson": 391, "special": 392, "_null": 393, "begin": 394, "setindex": 395, "ObjectClosure": 396, "ParserState": 397, "ntuple": 398, "existing": 399, "A": 400, "Helper": 401, "Foo": 402, "compact": 403, "GC": 404, "preserve": 405, "specific": 406, "dict": 407, "is_parametric": 408, "usage": 409, "line": 410, "point": 411, "resize": 412, "w": 413, "E": 414, "parsed": 415, "BigFloat": 416, "materialized": 417, "materialize": 418, "read": 419, "JSONWriteStyle": 420, "complex": 421, "Method": 422, "_omit_macro_impl": 423, "ismutable": 424, "fieldsblock": 425, "original": 426, "struct_expr": 427, "_find_struct_in_block": 428, "Handle": 429, "indentation": 430, "serialization": 431, "den": 432, "serializable": 433, "references": 434, "serializing": 435, "recursive": 436, "show": 437, "franken": 438, "specifies": 439, "float_style_check": 440, "_jsonlines_pretty_check": 441, "stringvec": 442, "force_resize": 443, "comma": 444, "unsafe_load": 445, "wroteanyref": 446, "el": 447, "escbytes": 448, "neg": 449, "access": 450, "Julia": 451, "snippet": 452, "regardless": 453, "Can": 454, "element": 455, "support": 456, "specifically": 457, "index": 458, "NOTE": 459, "abstract": 460, "ignore": 461, "Ref": 462, "spec": 463, "materialization": 464, "uses": 465, "ValueClosure": 466, "applyvalue": 467, "NULL": 468, "LazyArray": 469, "defining": 470, "dimensionality": 471, "above": 472, "float_precision_check": 473, "do": 474, "track": 475, "instance": 476, "setfield": 477, "getfield": 478, "position": 479, "pc": 480, "ensure": 481, "Examples": 482, "match": 483, "arguments": 484, "newline": 485, "than": 486, "define": 487, "dimension": 488, "innermost": 489, "override": 490, "dateformat": 491, "thus": 492, "our": 493, "updated": 494, "u": 495, "linear": 496, "itr": 497, "next": 498, "getlength": 499, "print": 500, "always": 501, "even": 502, "meaning": 503, "infinity": 504, "ignored": 505, "noarg": 506, "assert": 507, "avoid": 508, "something": 509, "push": 510, "pass": 511, "pair": 512, "done": 513, "d": 514, "getproperty": 515, "InvalidJSON": 516, "_lazy": 517, "Parsers": 518, "Enum": 519, "Returns": 520, "parametric": 521, "type_sig": 522, "recursively": 523, "standard": 524, "were": 525, "after": 526, "state": 527, "count": 528, "haskey": 529, "newlines": 530, "raw": 531, "preserved": 532, "arr": 533, "NUMBER": 534, "isfloat": 535, "TRUE": 536, "FALSE": 537, "getopts": 538, "label": 539, "UnexpectedEOF": 540, "LazyObject": 541, "kvs": 542, "inttype": 543, "compat": 544, "Convenience": 545, "more": 546, "stream": 547, "memory": 548, "implementations": 549, "Werewolf": 550, "skipped": 551, "isdefined": 552, "does": 553, "returned": 554, "NotSet": 555, "isequal": 556, "here": 557, "applyobject": 558, "isint": 559, "ExpectedComma": 560, "now": 561, "whitespace": 562, "_error": 563, "AbstractChar": 564, "VersionNumber": 565, "Cstring": 566, "Cwstring": 567, "UUID": 568, "TimeType": 569, "Regex": 570, "pattern": 571, "To": 572, "controlled": 573, "argument": 574, "MyStruct": 575, "three": 576, "ways": 577, "front": 578, "Applied": 579, "Chained": 580, "automatically": 581, "Struct": 582, "User": 583, "__module__": 584, "module_context": 585, "curly": 586, "Try": 587, "Macro": 588, "expands": 589, "Invalid": 590, "arg": 591, "various": 592, "file_name": 593, "determined": 594, "single": 595, "spaces": 596, "shorter": 597, "formatted": 598, "notation": 599, "operations": 600, "ncodeunits": 601, "AbstractSet": 602, "column": 603, "major": 604, "structs": 605, "compatibility": 606, "extra_field": 607, "S": 608, "flushing": 609, "float_style_throw": 610, "_jsonlines_pretty_throw": 611, "initial_size": 612, "StringVector": 613, "small": 614, "newlen": 615, "circular": 616, "checkkey": 617, "unsafe_store": 618, "lowered": 619, "throwjsonlines": 620, "_number": 621, "unsafe_convert": 622, "abs": 623, "infcheck": 624, "anyinvalidnumberchars": 625, "full": 626, "delete": 627, "leaf": 628, "provided": 629, "given": 630, "means": 631, "isjsonl": 632, "getisroot": 633, "characters": 634, "ptr": 635, "startpos": 636, "see": 637, "takes": 638, "methods": 639, "encountered": 640, "positive": 641, "they": 642, "keep": 643, "unless": 644, "since": 645, "AbstractCmd": 646, "ExpectedColon": 647, "InvalidNumber": 648, "current": 649, "res": 650, "level": 651, "g": 652, "structlike": 653, "character": 654, "float_precision_throw": 655, "got": 656, "same": 657, "codeunits": 658, "otherwise": 659, "specified": 660, "constructed": 661, "choosing": 662, "concrete": 663, "dimensional": 664, "Jim": 665, "some": 666, "syntax": 667, "specialized": 668, "objecttype": 669, "OT": 670, "nullvalue": 671, "_parse": 672, "checkendpos": 673, "Set": 674, "applyarray": 675, "parsenumber": 676, "cannot": 677, "endpos": 678, "pointer": 679, "j_": 680, "cus": 681, "li": 682, "LazyOptions": 683, "slen": 684, "digit": 685, "byteat": 686, "incr": 687, "_make_omit_type_sig": 688, "both": 689, "possibly": 690, "following": 691, "decimal": 692, "When": 693, "large": 694, "returning": 695, "owned": 696, "calling": 697, "nestings": 698, "common": 699, "expected": 700, "aggregate": 701, "isn": 702, "DateTime": 703, "few": 704, "date": 705, "min": 706, "still": 707, "bool": 708, "package": 709, "scan": 710, "generic": 711, "sets": 712, "without": 713, "MemoryParserState": 714, "Real": 715, "Logging": 716, "definitions": 717, "making": 718, "isempty": 719, "negative": 720, "numbers": 721, "Like": 722, "initial": 723, "last": 724, "around": 725, "inputs": 726, "linked": 727, "list": 728, "many": 729, "constructor": 730, "orig": 731, "vector": 732, "including": 733, "nonstruct": 734, "internal": 735, "isbigint": 736, "but": 737, "core": 738, "escaped": 739, "ccall": 740, "isneg": 741, "bval": 742, "ParserContext": 743, "removes": 744, "form": 745, "code": 746, "control": 747, "Default": 748, "certain": 749, "elements": 750, "doesn": 751, "kwdef": 752, "starts": 753, "allowed": 754, "div": 755, "efficient": 756, "consider": 757, "nobj": 758, "_v": 759, "find_node_by_key": 760, "KeyError": 761, "_propertynames": 762, "setproperty": 763, "Parse": 764, "call": 765, "catch": 766, "ExpectedOpeningObjectChar": 767, "ExpectedOpeningArrayChar": 768, "erri": 769, "EOF": 770, "convenience": 771, "StreamingParserState": 772, "AllowNanInf": 773, "chomp_space": 774, "AbstractFloat": 775, "Expected": 776, "floating": 777, "strings": 778, "implicit": 779, "subtype": 780, "calls": 781, "predefined": 782, "fieldtag": 783, "exists": 784, "lifted": 785, "plain": 786, "Main": 787, "St": 788, "extra_key": 789, "through": 790, "present": 791, "construction": 792, "import": 793, "there": 794, "insert_or_overwrite": 795, "path": 796, "cases": 797, "ptrstr": 798, "tr": 799, "fl": 800, "sglt": 801, "ex": 802, "consume": 803, "nany": 804, "module": 805, "ri": 806, "lazyfile": 807, "fully": 808, "selection": 809, "z": 810, "message": 811, "EarlyReturn": 812, "notes": 813, "lines": 814, "check_special": 815, "overflow": 816, "bres": 817, "LogLevel": 818, "axes": 819, "handles": 820, "expansions": 821, "walking": 822, "tree": 823, "compatible": 824, "annotation": 825, "Person": 826, "email": 827, "Apply": 828, "profile": 829, "Chain": 830, "Employee": 831, "Anonymous": 832, "manager": 833, "exclude": 834, "considered": 835, "collection": 836, "named": 837, "other_macro": 838, "macroexpand": 839, "Just": 840, "Extract": 841, "expansion": 842, "Block": 843, "hope": 844, "macrocall": 845, "expanded": 846, "did": 847, "expand": 848, "extract": 849, "expressions": 850, "subtyping": 851, "Bar": 852, "clauses": 853, "No": 854, "Define": 855, "Serialize": 856, "opened": 857, "All": 858, "accept": 859, "excluded": 860, "drop": 861, "Lines": 862, "separate": 863, "separated": 864, "printed": 865, "Pretty": 866, "limit": 867, "disabled": 868, "Options": 869, "preserves": 870, "exponential": 871, "places": 872, "Buffer": 873, "flushed": 874, "once": 875, "reaches": 876, "helps": 877, "during": 878, "parameter": 879, "controls": 880, "customizing": 881, "aspects": 882, "Rational": 883, "By": 884, "Supported": 885, "interface": 886, "boolean": 887, "singleton": 888, "subtypes": 889, "Generator": 890, "properly": 891, "implement": 892, "dimensions": 893, "fall": 894, "categories": 895, "iterated": 896, "Field": 897, "alternative": 898, "alternative_name": 899, "Some": 900, "defintions": 901, "itself": 902, "These": 903, "stdlib": 904, "Circular": 905, "tracked": 906, "cycles": 907, "broken": 908, "children": 909, "converted": 910, "See": 911, "reverse": 912, "operation": 913, "back": 914, "_not_": 915, "overloaded": 916, "robust": 917, "options": 918, "nor": 919, "situations": 920, "Types": 921, "cased": 922, "backwards": 923, "typically": 924, "mean": 925, "As": 926, "extremely": 927, "rare": 928, "decided": 929, "reasons": 930, "werewolf": 931, "comments": 932, "produced": 933, "respectively": 934, "follows": 935, "ISO": 936, "iszero": 937, "smaller": 938, "limited": 939, "Write": 940, "remaining": 941, "contents": 942, "growth": 943, "strategy": 944, "growing": 945, "approaches": 946, "grows": 947, "https": 948, "github": 949, "com": 950, "JuliaLang": 951, "pull": 952, "ceil": 953, "exceed": 954, "flush": 955, "partial": 956, "Resize": 957, "needed": 958, "wrote": 959, "Value": 960, "ismutabletype": 961, "know": 962, "skey": 963, "ancestor": 964, "stack": 965, "reference": 966, "pop": 967, "store": 968, "assume": 969, "dictlike": 970, "eagerly": 971, "overwrite": 972, "closechar": 973, "says": 974, "ok": 975, "escapelength": 976, "ESCAPECHARS": 977, "simd": 978, "Overloadable": 979, "themselves": 980, "double": 981, "quotes": 982, "An": 983, "look": 984, "MyDecimal": 985, "unsigned": 986, "Unsigned": 987, "isfinite": 988, "anyway": 989, "ndigits": 990, "pad": 991, "rem": 992, "oftype": 993, "isnan": 994, "isinf": 995, "writeshortest": 996, "writefixed": 997, "writeexp": 998, "unreachable": 999, "validate": 1000, "serialize": 1001, "insertion": 1002, "lookups": 1003, "vs": 1004, "hundreds": 1005, "thousands": 1006, "WARNING": 1007, "lookup": 1008, "enable": 1009, "InvalidChar": 1010, "these": 1011, "trim": 1012, "verify": 1013, "InvalidUTF16": 1014, "structure": 1015, "try": 1016, "leading": 1017, "continue": 1018, "Singleton": 1019, "sentinel": 1020, "literal": 1021, "per": 1022, "overrides": 1023, "lowering": 1024, "enclosing": 1025, "settings": 1026, "_root_omit_throw": 1027, "OrderedDict": 1028, "Objects": 1029, "Iterator": 1030, "yield": 1031, "dot": 1032, "acc": 1033, "merge": 1034, "IOStream": 1035, "Currently": 1036, "machinery": 1037, "kwarg": 1038, "different": 1039, "treated": 1040, "don": 1041, "unique": 1042, "matching": 1043, "Array": 1044, "though": 1045, "defines": 1046, "such": 1047, "functionality": 1048, "ideal": 1049, "time": 1050, "want": 1051, "entire": 1052, "trailing": 1053, "because": 1054, "user": 1055, "unsafe_string": 1056, "line_no": 1057, "snippet_bytes": 1058, "snippet_pos": 1059, "char": 1060, "textwidth": 1061, "invoke": 1062, "caret": 1063, "msg": 1064, "lazily": 1065, "navigating": 1066, "deeply": 1067, "what": 1068, "great": 1069, "required": 1070, "foreach": 1071, "helper": 1072, "applicable": 1073, "detect": 1074, "UTF": 1075, "BOM": 1076, "firstbyteeq": 1077, "implementation": 1078, "didn": 1079, "past": 1080, "EOFs": 1081, "foundr": 1082, "mem": 1083, "_tostr": 1084, "keyeq": 1085, "spos": 1086, "INT64_OVERFLOW_VAL": 1087, "INT": 1088, "FLOAT": 1089, "BIGINT": 1090, "BIGFLOAT": 1091, "IterateObjectClosure": 1092, "lo": 1093, "la": 1094, "isjsondigit": 1095, "IntType": 1096, "hasmore": 1097, "within": 1098, "functions": 1099, "Callable": 1100, "propertynames": 1101, "found": 1102, "take": 1103, "exist": 1104, "manually": 1105, "slow": 1106, "dispatch": 1107, "enum": 1108, "ExpectedOpeningQuoteChar": 1109, "ExpectedNewline": 1110, "multi": 1111, "errors": 1112, "Check": 1113, "DIGIT_ZERO": 1114, "utf8": 1115, "advance": 1116, "parse_value": 1117, "MINUS_SIGN": 1118, "Useful": 1119, "already": 1120, "variants": 1121, "treat": 1122, "delimited": 1123, "row": 1124, "overriding": 1125, "behaviors": 1126, "note": 1127, "below": 1128, "attempted": 1129, "utilizing": 1130, "interfaces": 1131, "matched": 1132, "against": 1133, "had": 1134, "those": 1135, "primitive": 1136, "rather": 1137, "runtime": 1138, "checked": 1139, "symbol": 1140, "wrapper": 1141, "prior": 1142, "knowledge": 1143, "target": 1144, "depths": 1145, "assumed": 1146, "equal": 1147, "lengths": 1148, "sizes": 1149, "lossless": 1150, "explicitly": 1151, "extra_value": 1152, "Let": 1153, "walk": 1154, "notable": 1155, "features": 1156, "determine": 1157, "recognizes": 1158, "polymorphic": 1159, "determines": 1160, "logic": 1161, "based": 1162, "teh": 1163, "compare": 1164, "construct": 1165, "dictionary": 1166, "parses": 1167, "Why": 1168, "provides": 1169, "several": 1170, "benefits": 1171, "Behaves": 1172, "replacement": 1173, "loss": 1174, "Performance": 1175, "savings": 1176, "faster": 1177, "typical": 1178, "Insertion": 1179, "Convenient": 1180, "again": 1181, "us": 1182, "specify": 1183, "under": 1184, "fieldtagkey": 1185, "started": 1186, "beginning": 1187, "consumed": 1188, "closure": 1189, "optimize": 1190, "insertions": 1191, "doing": 1192, "seen": 1193, "far": 1194, "duplicated": 1195, "latest": 1196, "sizehint": 1197, "hash": 1198, "_in": 1199, "dups": 1200, "unsafe": 1201, "previous": 1202, "fast": 1203, "append": 1204, "apply": 1205, "depending": 1206, "basically": 1207, "free": 1208, "allocate": 1209, "avoids": 1210, "reallocation": 1211, "never": 1212, "escapes": 1213, "issingletontype": 1214, "big": 1215, "switch": 1216, "ability": 1217, "generated": 1218, "maketuple": 1219, "fieldcount": 1220, "nexprs": 1221, "fieldtype": 1222, "extra": 1223, "replace": 1224, "supports": 1225, "foo": 1226, "Selecting": 1227, "about": 1228, "one": 1229, "iterating": 1230, "option": 1231, "Lazy": 1232, "Materialize": 1233, "rules": 1234, "programmatic": 1235, "very_large_json_object": 1236, "mutate": 1237, "individual": 1238, "ensures": 1239, "validation": 1240, "displayed": 1241, "Selectors": 1242, "immediately": 1243, "applied": 1244, "short": 1245, "help": 1246, "essentially": 1247, "positioned": 1248, "start": 1249, "ourselves": 1250, "corrupted": 1251, "random": 1252, "move": 1253, "jsonlines_checks": 1254, "allocation": 1255, "Memory": 1256, "memcmp": 1257, "Cint": 1258, "Csize_t": 1259, "typemax": 1260, "INT64_OVERFLOW_DIGIT": 1261, "BIG_ZERO": 1262, "xparse2": 1263, "tlen": 1264, "applylength": 1265, "IOContext": 1266, "MIME": 1267, "text": 1268, "DictType": 1269, "NullValue": 1270, "Char": 1271, "starting": 1272, "LATIN_U": 1273, "LATIN_A": 1274, "opening": 1275, "UInt16": 1276, "u1": 1277, "float_from_bytes": 1278, "use_mmap": 1279, "serializes": 1280, "callsite": 1281, "force": 1282, "emission": 1283, "Valid": 1284, "throws": 1285, "sentinels": 1286, "emits": 1287, "enabling": 1288, "declaring": 1289, "global": 1290, "easy": 1291, "optional": 1292, "entirely": 1293, "inside": 1294, "Internally": 1295, "represented": 1296, "represent": 1297, "way": 1298, "allowing": 1299, "deletion": 1300, "designed": 1301, "deserializing": 1302, "Because": 1303, "simple": 1304, "very": 1305, "worth": 1306, "overhead": 1307, "entries": 1308, "another": 1309, "duplicate": 1310, "iterator": 1311, "constructors": 1312, "either": 1313, "fallback": 1314, "callable": 1315, "finds": 1316, "inserts": 1317, "reach": 1318, "remove": 1319, "stdlibs": 1320, "UUIDs": 1321, "external": 1322, "dependencies": 1323, "PrecompileTools": 1324, "reexport": 1325, "export": 1326, "Error": 1327, "ExpectedClosingArrayChar": 1328, "compute": 1329, "falls": 1330, "counting": 1331, "up": 1332, "copy": 1333, "codepoint": 1334, "chars": 1335, "translate": 1336, "accounting": 1337, "repeat": 1338, "utils": 1339, "Wrapper": 1340, "containing": 1341, "escaping": 1342, "created": 1343, "Example": 1344, "Inputs": 1345, "aliases": 1346, "stdout": 1347, "compile_workload": 1348, "Common": 1349, "source": 1350, "lastindex": 1351, "possible": 1352, "escape": 1353, "space": 1354, "cur": 1355, "Return": 1356, "STRING_DELIM": 1357, "parse_string": 1358, "parse_jsconstant": 1359, "LATIN_E": 1360, "LATIN_F": 1361, "LATIN_L": 1362, "LATIN_N": 1363, "keyT": 1364, "read_four_hex_digits": 1365, "ending": 1366, "ASCII": 1367, "dig": 1368, "E_BAD_NUMBER": 1369, "unparameterize_type": 1370, "candidate": 1371, "_get_parsercontext": 1372, "corresponding": 1373, "Keyword": 1374, "Associative": 1375, "integers": 1376, "StructUtils.lowerkey": 1377, "generate": 1378, "signature": 1379, "instantiations": 1380, "base_type": 1381, "indicate": 1382, "numeric": 1383, "Detect": 1384, "Cmd": 1385, "opens": 1386, "selecting": 1387, "searching": 1388, "necessary": 1389, "leads": 1390, "conclusions": 1391, "effectively": 1392, "utilize": 1393, "finding": 1394, "repeated": 1395, "results": 1396, "naively": 1397, "Best": 1398, "practice": 1399, "sparingly": 1400, "benefit": 1401, "Another": 1402, "processing": 1403, "materializing": 1404, "forms": 1405, "Thus": 1406, "completeness": 1407, "sake": 1408, "repeatedly": 1409, "much": 1410, "Then": 1411, "normal": 1412, "We": 1413, "shoudl": 1414, "_not": 1415, "allowed_": 1416, "libraries": 1417, "reading": 1418, "sued": 1419, "separating": 1420, "logging": 1421, "streaming": 1422, "workflows": 1423, "Defaults": 1424, "extension": 1425, "jsonl": 1426, "ndjson": 1427, "_always_": 1428, "inferred": 1429, "Further": 1430, "later": 1431, "pack": 1432, "held": 1433, "isone": 1434, "strides": 1435, "wrapped": 1436, "scoped": 1437, "accessors": 1438, "overloads": 1439, "right": 1440, "selectors": 1441, "sources": 1442, "nulllike": 1443, "detects": 1444, "quick": 1445, "provide": 1446, "helpful": 1447, "circuit": 1448, "compared": 1449, "allocating": 1450, "circuiting": 1451, "terminating": 1452, "conditions": 1453, "delimiters": 1454, "terminators": 1455, "checks": 1456, "injected": 1457, "ve": 1458, "processed": 1459, "combo": 1460, "delimiter": 1461, "between": 1462, "until": 1463, "requires": 1464, "sure": 1465, "temporary": 1466, "deferrment": 1467, "VERSION": 1468, "jl_array_to_string": 1469, "jl_genericmemory_to_string": 1470, "unsafe_unescape_to_buffer": 1471, "jl_symbol_n": 1472, "Enums": 1473, "namemap": 1474, "semi": 1475, "_binary": 1476, "deal": 1477, "appropriately": 1478, "forcing": 1479, "NEVER": 1480, "visible": 1481, "users": 1482, "disallow": 1483, "unescaped_control": 1484, "rely": 1485, "infer": 1486, "kind": 1487, "isbigfloat": 1488, "part": 1489, "zeros": 1490, "exponent": 1491, "strict": 1492, "least": 1493, "specialvalue": 1494, "overflowed": 1495, "let": 1496, "efficiently": 1497, "op": 1498, "display": 1499, "iteration": 1500, "IndexStyle": 1501, "IndexLinear": 1502, "isassigned": 1503, "_getindex": 1504, "repr": 1505, "Parser": 1506, "Mmap": 1507, "isjsonspace": 1508, "SPACE": 1509, "utf8array": 1510, "thrown": 1511, "E_UNEXPECTED_EOF": 1512, "_error_expected_char": 1513, "cs": 1514, "Move": 1515, "_count_before": 1516, "haystack": 1517, "needle": 1518, "_end": 1519, "strnl": 1520, "parse_number": 1521, "parse_object": 1522, "parse_array": 1523, "LATIN_T": 1524, "LATIN_UPPER_N": 1525, "LATIN_UPPER_I": 1526, "LATIN_I": 1527, "Skip": 1528, "ARRAY_END": 1529, "DELIMITER": 1530, "OBJECT_END": 1531, "Read": 1532, "utf16_is_surrogate": 1533, "utf16_get_supplementary": 1534, "lead": 1535, "trail": 1536, "LATIN_UPPER_A": 1537, "E_BAD_ESCAPE": 1538, "read_unicode_escape": 1539, "BACKSLASH": 1540, "u2": 1541, "hasleadingzero": 1542, "Bytes": 1543, "enclosed": 1544, "int_from_bytes": 1545, "isnegative": 1546, "number_from_bytes": 1547, "DEFAULT_PARSERCONTEXT": 1548, "Parses": 1549, "mmap": 1550}